import type { PageLoad } from './$types';

interface NewsBlock {
	text?: string;
	image?: string;
}

interface NewsArticle {
	title: string;
	subtitle?: string;
	mainImage?: string;
	blocks: NewsBlock[];
}

export const load: PageLoad = ({ params }): NewsArticle => {
	const { slug } = params;

	if (slug === 'zaborolsky') {
		return {
			title: 'Профорієнтаційна зустріч у "Заборольському ліцеї № 32 Луцької міської ради"',
			subtitle:
				'Викладачка Фахового коледжу технологій, бізнесу та права ВНУ імені Лесі Українки  Людмила ГОЛУБ провела профорієнтаційну зустріч.',
			mainImage: '/images/news/probnik-news.jpeg',

			blocks: [
				{
					text: 'Викладачка Фахового коледжу технологій, бізнесу та права ВНУ імені Лесі Українки  Людмила ГОЛУБ провела профорієнтаційну зустріч у "Заборольському ліцеї № 32 Луцької міської ради" у вигляді круглого столу.'
				},
				{
					text: 'Учні 9-х класів дізналися про спеціальності, які пропонує  заклад, сучасні підходи до навчання та перспективи, що відкриваються перед випускниками. Особливий акцент було зроблено на існуючих напрямках профільної підготовки, які відповідають потребам ринку праці. Зустріч відбулась у теплій атмосфері.'
				},
				{
					text: 'Дякуємо Заборольському ліцею в особі Ірини ПРИЙМАЧУК за надану можливість.'
				}
			]
		};
	}

	throw new Error('Новину не знайдено');
};
